        const data = {
            geaan: ["بيتزا مشكل", "كشري التحرير", "برجر من المطعم اللي بنحبه", "مشويات شياكة", "مكرونة وايت صوص"],
            arouh: ["تمشية ع الكورنيش", "سينما مول العرب", "قعدة هادية في حديقة الأزهر", "مطعم في الزمالك", "خروجة مفاجأة"],
            tasks: [
                {t: "تجهيز هدايا زوجتي", d: false},
                {t: "حجز مطعم أول يوم", d: false},
                {t: "تأكيد ميعاد الطائرة", d: true},
                {t: "تجهيز شنطة السفر", d: true}
            ]
        };
